app/controllers/clicks_controller.rb

  def new
    @clicks_count = Click.count
---
SELECT COUNT(*) FROM "clicks"

  def create
    @click = Click.create(click_params)
---
INSERT INTO "clicks" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-06-15 15:45:15.309643"], ["updated_at", "2016-06-15 15:45:15.309643"]]

    def set_click
      @click = Click.find(params[:id])
---
SELECT  "clicks".* FROM "clicks" WHERE "clicks"."id" = ? LIMIT 1  [["id", 1]]